app/views/users/new.html.erb

SELECT `sucursals`.* FROM `sucursals`
---
            <%= form.label :seleccione_una_sucursal %>
            <%= form.select "sucursal_id", options_for_select(Sucursal.all.collect { |su| [su.nombre, su.id] }, @usuario.sucursal_id)%>