app/views/usuarios/index.html.erb

    <td> <%= usu.email %> </td>
    <td> <%= usu.roles.pluck(:name) %> </td>
---
SELECT `roles`.`name` FROM `roles` INNER JOIN `usuarios_roles` ON `roles`.`id` = `usuarios_roles`.`role_id` WHERE `usuarios_roles`.`usuario_id` = 9