app/controllers/horarios_controller.rb

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
---
    def new
        @horarios = Horario.new
        @sucursal = Sucursal.find(params[:id])

INSERT INTO `horarios` (`sucursal_id`, `dia`, `hora_inicio`, `hora_fin`, `created_at`, `updated_at`) VALUES (1, 'Lunes', '15:15:00', '18:15:00', '2022-11-30 02:32:45.399211', '2022-11-30 02:32:45.399211')
---
    def create
        pp "ESTO ES EL HROARIO", params
        @horario = Horario.new({:dia => params[:horario][:dia], :hora_inicio => params[:horario][:hora_inicio], :hora_fin => params[:horario][:hora_fin], :sucursal_id => params[:horario][:sucursal_id] })
        #begin
            if @horario.save

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
SELECT `horarios`.* FROM `horarios` WHERE `horarios`.`sucursal_id` = 1 LIMIT 1
---
    def show
        @sucursal = Sucursal.find(params[:id])
        @horario = Horario.where(:sucursal_id => params[:id])

SELECT `horarios`.* FROM `horarios` WHERE `horarios`.`id` IN (NULL)
---
    def edit
        @horario = Horario.find(params[:id])