app/controllers/sucursales_controller.rb

SELECT `sucursals`.* FROM `sucursals`
---
    def index
        @sucursales = Sucursal.all

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
---
    def show
        @sucursal = Sucursal.find(params[:id])

SELECT `sucursals`.* FROM `sucursals`
---
    def index_turno
        @sucursales = Sucursal.all

INSERT INTO `sucursals` (`nombre`, `direccion`, `telefono`, `created_at`, `updated_at`) VALUES ('fsqa', 'asdfa', 1212, '2022-11-30 01:11:55.471861', '2022-11-30 01:11:55.471861')
---
    def create
        @sucursal = Sucursal.new({:nombre => params[:nombre], :direccion => params[:direccion], :telefono => params[:telefono] })
        if @sucursal.save

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
DELETE FROM `sucursals` WHERE `sucursals`.`id` = 5
---
    def destroy
        @sucursal = Sucursal.find(params[:id])
        #@usuarios = Sucursal.find(params[:id]).usuarios
        if Sucursal.chequear_eliminar(params[:id])
            @sucursal.destroy

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
UPDATE `sucursals` SET `sucursals`.`nombre` = 'lalala', `sucursals`.`direccion` = 'asdd', `sucursals`.`telefono` = 26256, `sucursals`.`updated_at` = '2022-12-07 21:37:08.473871' WHERE `sucursals`.`id` = 1
---
    def update
        @sucu = Sucursal.find(params[:id])
        begin @sucu.update({:nombre => params[:nombre], :direccion => params[:direccion], :telefono => params[:telefono] })