app/controllers/turnos_controller.rb

    def create
        #pp "fecha formateada para obtener el nombre del dia",I18n.l(Date.parse(params[:turno][:fecha].to_s),format: '%A')
        pp "esto me devuelve:",Sucursal.chequear_turno(I18n.l(Date.parse(params[:turno][:fecha].to_s),format: '%A'),params[:turno][:hora],params[:turno][:sucursal_id])
        if Sucursal.chequear_turno(I18n.l(Date.parse(params[:turno][:fecha].to_s),format: '%A'),params[:turno][:hora],params[:turno][:sucursal_id])
            @turno = Turno.new(turno_params)
            @turno.cliente_id = current_usuario.id
            if @turno.save
---
INSERT INTO `turnos` (`sucursal_id`, `cliente_id`, `personal_id`, `fecha`, `hora`, `motivo`, `estado`, `created_at`, `updated_at`) VALUES (1, 3, NULL, '2022-12-30', '13:30:00', 'fadfdas', 'Pendiente', '2022-12-06 23:55:20.681575', '2022-12-06 23:55:20.681575')