app/controllers/turnos_controller.rb

SELECT `turnos`.* FROM `turnos` WHERE `turnos`.`estado` = 'Pendiente'
SELECT `turnos`.* FROM `turnos`
---
    def index
        begin
            @estado = params[:estado]
            if current_usuario.role == "Personal Bancario"
                @turnos = Turno.where(:estado => params[:estado], :sucursal_id => current_usuario.sucursal_id)
            else
                @turnos = Turno.where(:estado => params[:estado], :cliente_id => current_usuario.id)
            end
        rescue
            @turnos = Turno.all

SELECT `turnos`.* FROM `turnos` WHERE `turnos`.`id` = 1 LIMIT 1
---
    def show
        @turno = Turno.find(params[:id])

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
---
    def edit
        @turno = Turno.find(params[:id])
        @sucursal = Turno.find(params[:id]).sucursal

SELECT `turnos`.* FROM `turnos` WHERE `turnos`.`id` = 1 LIMIT 1
---
    def update
        @turno = Turno.find(params[:id])

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
---
    def new
        @cliente_id = current_usuario.id
        @sucursal = Sucursal.find(params[:id])

INSERT INTO `turnos` (`sucursal_id`, `cliente_id`, `personal_id`, `fecha`, `hora`, `motivo`, `estado`, `created_at`, `updated_at`) VALUES (1, 1, NULL, '2022-12-30', '13:30:00', 'dsa', 'Pendiente', '2022-12-06 19:18:50.241432', '2022-12-06 19:18:50.241432')
---
    def create
        begin
            if Sucursal.chequear_turno(I18n.l(Date.parse(params[:turno][:fecha].to_s),format: '%A'),params[:turno][:hora],params[:turno][:sucursal_id])
                @turno = Turno.new(turno_params)
                @turno.cliente_id = current_usuario.id
                if @turno.save

SELECT `turnos`.* FROM `turnos` WHERE `turnos`.`id` = 1 LIMIT 1
DELETE FROM `turnos` WHERE `turnos`.`id` = 1
---
    def destroy
        @turno = Turno.find(params[:id])
        @turno.destroy