app/controllers/users_controller.rb

SELECT `usuarios`.* FROM `usuarios`
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`role` = 'Cliente'
---
    def index
        if params[:role].nil?
            @usuarios = Usuario.all
        else
            @usuarios = Usuario.where(:role => params[:role])

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 9 LIMIT 1
---
    def show
        @usuario = Usuario.find(params[:id])

SELECT `sucursals`.* FROM `sucursals`
---
    def new
        @admin = params[:admin]
        @sucursales = Sucursal.all

INSERT INTO `usuarios` (`nombre`, `encrypted_password`, `email`, `role`, `sucursal_id`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `created_at`, `updated_at`) VALUES ('pruerba', '$2a$12$7fLd.ofZSk29rnhZCHxoCOGN2gRFb76D9FOb7YRdGKOUAIlrIeqxW', 'aa@aaaaa', 'Personal Bancario', 1, NULL, NULL, NULL, '2022-12-06 22:20:26.667213', '2022-12-06 22:20:26.667213')
UPDATE `usuarios` SET `usuarios`.`role` = 'Personal Bancario', `usuarios`.`updated_at` = '2022-11-29 22:02:02.905361' WHERE `usuarios`.`id` = 1
---
    def create

        begin @usuario = Usuario.create({:nombre => params[:nombre], :email => params[:email], :password => params[:password], :password_confirmation => params[:password_confirmation], :role => params[:role], :sucursal_id => params[:sucursal_id] })
            if @usuario.save

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 9 LIMIT 1
---
    def edit
        @edita_perfil = false
        @admin = params[:admin]
        @usuario = Usuario.find(params[:id])

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 16 LIMIT 1
UPDATE `usuarios` SET `usuarios`.`nombre` = '', `usuarios`.`role` = 'Administrador', `usuarios`.`updated_at` = '2022-12-06 00:43:52.746372' WHERE `usuarios`.`id` = 1
---
    def update
        @user = Usuario.find(params[:id])
        if @user.update(update_params)