app/controllers/usuarios_controller.rb

    def index
        @usuarios = Usuario.all
---
SELECT `usuarios`.* FROM `usuarios`