app/models/sucursal.rb

    def self.chequear_turno(dia,hora_solicitada,sucursal_id)
        horarios = Sucursal.find(sucursal_id).horario
        horarios.each do |ho|
---
SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 2 LIMIT 1
SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1
SELECT `horarios`.* FROM `horarios` WHERE `horarios`.`sucursal_id` IS NULL

    def self.chequear_eliminar(sucursal_id)
        usuarios = Sucursal.find(sucursal_id).usuarios
        turnos = Sucursal.find(sucursal_id).turnos
        if usuarios.empty?
            turnos.each do |tu|
---
SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 5 LIMIT 1
SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 1 LIMIT 1
SELECT 1 AS one FROM `usuarios` WHERE `usuarios`.`sucursal_id` = 4 LIMIT 1
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`sucursal_id` = 1
SELECT `turnos`.* FROM `turnos` WHERE `turnos`.`sucursal_id` = 1