app/views/turnos/new.html.erb

SELECT `sucursals`.* FROM `sucursals`
---
        <%= form.label :sucursal %>
        <%= form.select "sucursal", @sucursales.map{ |su| ["#{su.nombre}", su.id] }, :multiple => true %>