app/views/turnos/new.html.erb

  </tr>
  <% @sucursal.horario.each do |ho| %>
---
SELECT `horarios`.* FROM `horarios` WHERE `horarios`.`sucursal_id` = 1